In [32]:
import pandas as pd
import numpy as np

In [33]:
df = pd.read_csv('data/coffee.csv')

In [34]:
df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [35]:
df.shape

(14, 3)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 464.0+ bytes

In [37]:
df.describe()

       Units Sold
count   14.000000
mean    32.857143
std      9.346798
min     15.000000
25%     26.250000
50%     35.000000
75%     38.750000
max     45.000000

In [38]:
df['Units Sold'].sum()

np.int64(460)

In [39]:
df.groupby('Coffee Type')['Units Sold'].sum()

Coffee Type
Espresso    265
Latte       195
Name: Units Sold, dtype: int64

In [40]:
df.groupby(['Day', 'Coffee Type'])['Units Sold'].mean()

Day        Coffee Type
Friday     Espresso       45.0
           Latte          35.0
Monday     Espresso       25.0
           Latte          15.0
Saturday   Espresso       45.0
           Latte          35.0
Sunday     Espresso       45.0
           Latte          35.0
Thursday   Espresso       40.0
           Latte          30.0
Tuesday    Espresso       30.0
           Latte          20.0
Wednesday  Espresso       35.0
           Latte          25.0
Name: Units Sold, dtype: float64

In [41]:
df.pivot_table(index = 'Day',columns = ['Coffee Type'])

            Units Sold
Coffee Type   Espresso Latte
Day
Friday            45.0  35.0
Monday            25.0  15.0
Saturday          45.0  35.0
Sunday            45.0  35.0
Thursday          40.0  30.0
Tuesday           30.0  20.0
Wednesday         35.0  25.0

In [42]:
df['Revenue'] = df.apply(lambda x: x['Units Sold']* 2.5 if x['Coffee Type'] == 'Espresso' else x['Units Sold'] * 3.0, axis = 1)

In [43]:
df.head()

         Day Coffee Type  Units Sold  Revenue
0     Monday    Espresso          25     62.5
1     Monday       Latte          15     45.0
2    Tuesday    Espresso          30     75.0
3    Tuesday       Latte          20     60.0
4  Wednesday    Espresso          35     87.5

In [44]:
# df['Revnp.where'] = np.where(
#     df['Coffee Type'] == 'Espresso',
#     df['Units Sold'] * 2.5,
#     df['Units Sold'] * 3
# )

In [45]:
df.head()

         Day Coffee Type  Units Sold  Revenue
0     Monday    Espresso          25     62.5
1     Monday       Latte          15     45.0
2    Tuesday    Espresso          30     75.0
3    Tuesday       Latte          20     60.0
4  Wednesday    Espresso          35     87.5

In [49]:
df.groupby('Coffee Type')['Revenue'].sum()

Coffee Type
Espresso    662.5
Latte       585.0
Name: Revenue, dtype: float64

In [50]:
df.groupby('Day')['Revenue'].sum().sort_values(ascending = False)

Day
Friday       217.5
Saturday     217.5
Sunday       217.5
Thursday     190.0
Wednesday    162.5
Tuesday      135.0
Monday       107.5
Name: Revenue, dtype: float64

In [51]:
df['Revenue Per Unit'] = df['Revenue'] / df['Units Sold']
df.head()

         Day Coffee Type  Units Sold  Revenue  Revenue Per Unit
0     Monday    Espresso          25     62.5               2.5
1     Monday       Latte          15     45.0               3.0
2    Tuesday    Espresso          30     75.0               2.5
3    Tuesday       Latte          20     60.0               3.0
4  Wednesday    Espresso          35     87.5               2.5

In [65]:
df.groupby(['Coffee Type', 'Day'])['Units Sold'].mean()

Coffee Type  Day
Espresso     Friday       45.0
             Monday       25.0
             Saturday     45.0
             Sunday       45.0
             Thursday     40.0
             Tuesday      30.0
             Wednesday    35.0
Latte        Friday       35.0
             Monday       15.0
             Saturday     35.0
             Sunday       35.0
             Thursday     30.0
             Tuesday      20.0
             Wednesday    25.0
Name: Units Sold, dtype: float64

In [67]:
df.groupby('Coffee Type')['Units Sold'].mean()

Coffee Type
Espresso    37.857143
Latte       27.857143
Name: Units Sold, dtype: float64

In [69]:
df.sort_values('Revenue',ascending = False).head(1)

         Day Coffee Type  Units Sold  Revenue  Revenue Per Unit
10  Saturday    Espresso          45    112.5               2.5

In [74]:
df[(df['Day'] == 'Sunday') & (df['Coffee Type'] == 'Latte')]

13    105.0
Name: Revenue, dtype: float64

In [75]:
weekday_filtered_df = df[(df['Day'] != 'Saturday') & (df['Day'] != 'Sunday')]

In [76]:
weekday_filtered_df

         Day Coffee Type  Units Sold  Revenue  Revenue Per Unit
0     Monday    Espresso          25     62.5               2.5
1     Monday       Latte          15     45.0               3.0
2    Tuesday    Espresso          30     75.0               2.5
3    Tuesday       Latte          20     60.0               3.0
4  Wednesday    Espresso          35     87.5               2.5
5  Wednesday       Latte          25     75.0               3.0
6   Thursday    Espresso          40    100.0               2.5
7   Thursday       Latte          30     90.0               3.0
8     Friday    Espresso          45    112.5               2.5
9     Friday       Latte          35    105.0               3.0

In [77]:
weekday_filtered_df[weekday_filtered_df['Coffee Type'] == 'Espresso']['Units Sold'].mean()

np.float64(35.0)

In [78]:
df = pd.read_csv('data/bios.csv')

In [79]:
df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [81]:
df.isna().sum()

athlete_id           0
name                 0
born_date         1807
born_city        34592
born_region      34592
born_country     34592
NOC                  1
height_cm        38849
weight_kg        43430
died_date       111560
dtype: int64

In [82]:
df.groupby('NOC')['height_cm'].mean()

NOC
Afghanistan               170.170732
Albania                   174.200000
Albania Australia         166.000000
Albania Bulgaria          189.000000
Albania Greece            165.000000
                             ...
West Indies Federation    176.000000
Yemen                     169.391304
Yugoslavia                180.035980
Zambia                    169.852174
Zimbabwe                  173.335196
Name: height_cm, Length: 696, dtype: float64

In [83]:
df.groupby('NOC')['weight_kg'].median()

NOC
Afghanistan                66.0
Albania                    74.5
Albania Australia          65.0
Albania Bulgaria          100.0
Albania Greece             64.0
                          ...
West Indies Federation     70.5
Yemen                      60.0
Yugoslavia                 75.0
Zambia                     64.5
Zimbabwe                   67.0
Name: weight_kg, Length: 696, dtype: float64

In [84]:
df['NOC'].value_counts()

NOC
United States         10114
Great Britain          6421
France                 6339
Canada                 5276
Italy                  5189
                      ...
Israel Ukraine            1
Italy Spain               1
Canada Italy              1
Brazil Croatia            1
Mexico Netherlands        1
Name: count, Length: 696, dtype: int64

In [88]:
df.groupby(['NOC'])['weight_kg'].mean()

NOC
Afghanistan                67.076923
Albania                    74.285714
Albania Australia          65.000000
Albania Bulgaria          100.000000
Albania Greece             64.000000
                             ...
West Indies Federation     71.500000
Yemen                      60.476190
Yugoslavia                 76.444444
Zambia                     64.808511
Zimbabwe                   68.089888
Name: weight_kg, Length: 696, dtype: float64

In [104]:
df.dropna(subset=['height_cm', 'weight_kg']).groupby('NOC')[['height_cm', 'weight_kg']].corr().sort_values('height_cm',ascending = False).head(5)

                       height_cm  weight_kg
NOC
Zimbabwe    height_cm        1.0   0.775582
Afghanistan height_cm        1.0   0.535870
Zambia      height_cm        1.0   0.716017
Albania     height_cm        1.0   0.810495
Uzbekistan  height_cm        1.0   0.736774

In [105]:
df.isna().sum()

athlete_id           0
name                 0
born_date         1807
born_city        34592
born_region      34592
born_country     34592
NOC                  1
height_cm        38849
weight_kg        43430
died_date       111560
dtype: int64

In [109]:
df.groupby('NOC')[['height_cm', 'weight_kg']].corr().reset_index()

                    NOC    level_1  height_cm  weight_kg
0           Afghanistan  height_cm   1.000000   0.535870
1           Afghanistan  weight_kg   0.535870   1.000000
2               Albania  height_cm   1.000000   0.810495
3               Albania  weight_kg   0.810495   1.000000
4     Albania Australia  height_cm        NaN        NaN
...                 ...        ...        ...        ...
1387         Yugoslavia  weight_kg   0.811031   1.000000
1388             Zambia  height_cm   1.000000   0.716017
1389             Zambia  weight_kg   0.716017   1.000000
1390           Zimbabwe  height_cm   1.000000   0.775582
1391           Zimbabwe  weight_kg   0.775582   1.000000

[1392 rows x 4 columns]

In [111]:
df['born_date'] = pd.to_datetime(df['born_date'])

In [121]:
df[df['born_date'].dt.year > 1970].groupby('NOC')['height_cm'].mean().reset_index()

                   NOC   height_cm
0          Afghanistan  172.153846
1              Albania  174.304348
2    Albania Australia  166.000000
3     Albania Bulgaria  189.000000
4       Albania Greece  165.000000
..                 ...         ...
456       West Germany  164.600000
457              Yemen  169.428571
458         Yugoslavia  171.000000
459             Zambia  166.489362
460           Zimbabwe  172.738462

[461 rows x 2 columns]

In [124]:
df['NOC'].value_counts().tail(30)

NOC
Great Britain Paraguay                                   1
Lithuania Russian Federation                             1
Canada Pakistan                                          1
Netherlands Russian Federation Unified Team              1
Bulgaria Switzerland                                     1
Croatia Slovenia                                         1
Australia Canada                                         1
Belarus Finland                                          1
Australia Slovenia                                       1
Canada Great Britain Sweden                              1
Croatia Russian Federation                               1
Georgia Serbia                                           1
Greece Türkiye                                           1
United States Uzbekistan                                 1
Slovakia Soviet Union Unified Team                       1
Independent Olympic Athletes United States Yugoslavia    1
Aruba Independent Olympic Athletes                       1
Germany Panama                                           1
Independent Olympic Athletes Netherlands                 1
France Spain                                             1
Turkmenistan Türkiye                                     1
Refugee Olympic Team Syrian Arab Republic                1
Democratic People's Republic of Korea Korea Team         1
France Sweden                                            1
Azerbaijan Kazakhstan                                    1
Israel Ukraine                                           1
Italy Spain                                              1
Canada Italy                                             1
Brazil Croatia                                           1
Mexico Netherlands                                       1
Name: count, dtype: int64

In [128]:
df[(df['born_date'].dt.year > 1970) & (df['weight_kg'] > 90)].groupby('NOC')['height_cm'].mean().sort_values( ascending = False).head(5)

NOC
Zimbabwe                        205.0
Finland South Africa            203.0
Mali                            203.0
Hungary Slovakia                202.0
Australia Russian Federation    202.0
Name: height_cm, dtype: float64

In [129]:
df['BMI'] = df['weight_kg'] / np.pow(df['height_cm'] / 100, 2)

In [137]:
df[df['born_date'].dt.year > 1980].groupby('NOC')['BMI'].mean().sort_values(ascending = False).head(5)

NOC
Austria Germany     35.237475
Nauru               33.966028
Brazil Croatia      31.236985
Australia Canada    30.829340
Georgia Poland      30.346074
Name: BMI, dtype: float64

In [138]:
above_df = df[df['born_date'].dt.year > 1980]